# 3장 판다스 시리즈와 데이터프레임 실행하기

- 이번에는 **시리즈와 데이터프레임으로 연산자를 실행해보고 간단한 메소드를 처리하는 방법**을 익힙니다. 
  - 시리즈와 데이터프레임 공통 메소드 
  - 연산자와 메소드 연산 이해하기 
  - 메소드를 이용한 다양한 처리 알아보기 
  - 누락 값 처리하기 
  - 범주형 데이터 처리하기

In [359]:
import os 

os.getcwd()   # 내가 현재 어느 폴더에 위치해 있는 지를 표시

'C:\\Users\\leesd\\PyProjects\\3-2-손에 잡히는 Pandas\\HIP-03장 예제'

In [360]:
# os.chdir('../HIP-01장 예제')   # 상대경로 이동 
os.chdir('../data')   # 상대경로 이동 

os.getcwd()   # 내가 현재 어느 폴더에 위치해 있는 지를 표시

'C:\\Users\\leesd\\PyProjects\\3-2-손에 잡히는 Pandas\\data'

In [361]:
import warnings     # 파이썬 기본적인 경고메세지 처리하기     

warnings.filterwarnings(action='ignore')      # 기본적인 경고메세지 무시하기 
# warnings.filterwarnings(action='default')    # 기본적인 경고메세지 기본값으로 표시하기

In [362]:
%load_ext watermark
%watermark -v -p numpy,scipy,sklearn,pandas,matplotlib

CPython 3.8.3
IPython 7.16.1

numpy 1.18.5
scipy 1.5.0
sklearn 0.0
pandas 1.0.5
matplotlib 3.2.2

## 예제 3-1  시리즈와 데이터프레임 내의 동일 메소드 확인

- 시리즈와 데이터프레임 안의 메소드를 확인해 같은 이름의 메소드를 확인한다.   
- 작업 절차 
  1. 시리즈와 데이터프레임이 갖는 속성과 메소드를 CSV파일로 저장한다.  
  2. 이 파일을 읽고 속성과 메소드를 분리해 처리한다.  
- 파이썬은 인스턴스 메소드를 클래스에서 보관한다.  
  - 클래스에서 인스턴스 메소드를 단순한 함수로 인식한다.  
  - 실제 인스턴스에서 메소드를 바인딩할 때 인스턴스 메소드로 변화되어 처리한다.

In [364]:
import pandas as pd

#### 시리즈와 데이터 프레임에 있는 속성과 메소드 정보를 모아둔 csv 파일을 읽는다.  
- 파일은 기본적으로 영어로 되어 있어 인코딩을 하지 않아도 된다.

In [368]:
op = pd.read_csv('../data/series_dataframe.csv')    # Series, dataframe의 속성을 기록한 csv 
op.head(7)    # 상위 10행만 확인

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix
5         agg         agg         agg
6   aggregate   aggregate   aggregate

- 데이터 프레임을 읽어오면 2차원 데이터 인지를 확인하기 위해 .shape 속성을 확인한다.  
- 데이터 프레임은 
  - 하나의 열(컬럼)은 Series에 대한 정보이고 다른 열은 DataFrame이다.  
  - 이 두 컬럼을 == 연산자로 비교하면 두 열의 각 원소별로 비교한 결과를 bool값으로 반환한다.

In [181]:
op.shape      # 264 X 3 Matrice

(264, 3)

In [369]:
(op['Series'] == op['DataFrame']).head()    # 두 개의 객체의 메소드가 같은 것을 비교해 bool값 판단

0    True
1    True
2    True
3    True
4    True
dtype: bool

In [370]:
op_eq = op.loc[(op['Series'] == op['DataFrame'])]     # 양쪽이 서로 같은 method가 있는 것만 추출 
op_eq.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [371]:
op_eq.shape

(190, 3)

In [372]:
op_eq.tail()

     Member  Series DataFrame
256  update  update    update
259  values  values    values
260     var     var       var
262   where   where     where
263      xs      xs        xs

- 동일한 멤버가 들어 있는 하나의 컬럼을 선택해서 리스트로 변환한다.  
- 이 때 .tolist 메소드를 실행하고 이를 op_eq_list 변수에 할당한다.

In [373]:
op_eq_list = op_eq['Member'].tolist()
op_eq_list

['T',
 'abs',
 'add',
 'add_prefix',
 'add_suffix',
 'agg',
 'aggregate',
 'align',
 'all',
 'any',
 'append',
 'apply',
 'as_blocks',
 'as_matrix',
 'asfreq',
 'asof',
 'astype',
 'at',
 'at_time',
 'axes',
 'between_time',
 'bfill',
 'blocks',
 'bool',
 'clip',
 'clip_lower',
 'clip_upper',
 'combine',
 'combine_first',
 'compound',
 'consolidate',
 'convert_objects',
 'copy',
 'corr',
 'count',
 'cov',
 'cummax',
 'cummin',
 'cumprod',
 'cumsum',
 'describe',
 'diff',
 'div',
 'divide',
 'dot',
 'drop',
 'drop_duplicates',
 'dropna',
 'dtypes',
 'duplicated',
 'empty',
 'eq',
 'equals',
 'ewm',
 'expanding',
 'ffill',
 'fillna',
 'filter',
 'first',
 'first_valid_index',
 'floordiv',
 'from_csv',
 'ftypes',
 'ge',
 'get',
 'get_dtype_counts',
 'get_ftype_counts',
 'get_value',
 'get_values',
 'groupby',
 'gt',
 'head',
 'hist',
 'iat',
 'idxmax',
 'idxmin',
 'iloc',
 'index',
 'infer_objects',
 'interpolate',
 'is_copy',
 'isin',
 'isna',
 'isnull',
 'ix',
 'keys',
 'kurt',
 'kurtosis',
 'last',
 'last_valid_index',
 'le',
 'loc',
 'lt',
 'mad',
 'mask',
 'max',
 'mean',
 'median',
 'memory_usage',
 'min',
 'mod',
 'mode',
 'mul',
 'multiply',
 'ndim',
 'ne',
 'nlargest',
 'notna',
 'notnull',
 'nsmallest',
 'nunique',
 'pct_change',
 'pipe',
 'plot',
 'pop',
 'pow',
 'prod',
 'product',
 'quantile',
 'radd',
 'rank',
 'rdiv',
 'reindex',
 'reindex_axis',
 'reindex_like',
 'rename',
 'rename_axis',
 'reorder_levels',
 'replace',
 'resample',
 'reset_index',
 'rfloordiv',
 'rmod',
 'rmul',
 'rolling',
 'round',
 'rpow',
 'rsub',
 'rtruediv',
 'sample',
 'select',
 'sem',
 'set_axis',
 'set_value',
 'shape',
 'shift',
 'size',
 'skew',
 'slice_shift',
 'sort_index',
 'sort_values',
 'sortlevel',
 'squeeze',
 'std',
 'sub',
 'subtract',
 'sum',
 'swapaxes',
 'swaplevel',
 'tail',
 'take',
 'to_clipboard',
 'to_csv',
 'to_dense',
 'to_dict',
 'to_excel',
 'to_hdf',
 'to_json',
 'to_latex',
 'to_msgpack',
 'to_period',
 'to_pickle',
 'to_sparse',
 'to_sql',
 'to_string',
 'to_timestamp',
 'to_xarray',
 'transform',
 'transpose',
 'truediv',
 'truncate',
 'tshift',
 'tz_convert',
 'tz_localize',
 'unstack',
 'update',
 'values',
 'var',
 'where',
 'xs']

- 같은 멤버들 중에서 함수를 찾아서 확인해 본다.  
- types 모듈을 import 한다.

In [187]:
import types

- 시리즈 클래스의 네임스페이스인 __ dict__안의 속성을 확인하기 위해 문자열을 전달한다.  
- 매칭되는 객체를 찾아 types.FunctionType과 비교하여 True이면 함수이다.  


- 파이썬 클래스에 있는 인스턴스 메소드는 
  - 클래스로 있을 때는 함수로 체크되고 
  - 인스턴스 객체와 바인딩 될 때 인스턴스 메소드로 변환된다.

In [375]:
count = 0 
for i in op_eq_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
        if count % 7 == 0 :     # 추출된 메소드를 한 줄에 7개씩 print 함 
            print()
    except Exception as e :
        pass

add,  agg,  aggregate,  align,  all,  any,  append,
apply,  combine,  combine_first,  corr,  count,  cov,  cummax,
cummin,  cumprod,  cumsum,  diff,  div,  divide,  dot,
drop,  drop_duplicates,  dropna,  duplicated,  eq,  ewm,  expanding,
fillna,  floordiv,  ge,  groupby,  gt,  hist,  idxmax,
idxmin,  isin,  isna,  isnull,  keys,  kurt,  kurtosis,
le,  lt,  mad,  max,  mean,  median,  memory_usage,
min,  mod,  mode,  mul,  multiply,  ne,  nlargest,
notna,  notnull,  nsmallest,  pow,  prod,  product,  quantile,
radd,  rdiv,  reindex,  rename,  reorder_levels,  replace,  reset_index,
rfloordiv,  rmod,  rmul,  rolling,  round,  rpow,  rsub,
rtruediv,  sem,  shift,  skew,  sort_index,  sort_values,  std,
sub,  subtract,  sum,  swaplevel,  take,  to_dict,  to_period,
to_string,  to_timestamp,  transform,  truediv,  unstack,  update,  var,

## 예제 3-2  연산자와 메소드 처리
- 연산자와 메소드를 이용할 때는 시리즈나 데이터프레임의 컬럼 자료형에 맞는 계산을 한다.  
- 배열 처리를 위해 numpy 모듈에서 빌려와서 연산을 수행하므로 별도의 순환문 처리가 필요없다.

In [378]:
college = pd.read_csv('../data/2017_college_tuition.csv',encoding='euc-kr')
college.head()     # 대학 등록금 파일을 읽어와서 college변수에 할당

         학교명 설립구분  평균등록금
0    강릉원주대학교  국공립   4262
1      강원대학교  국공립   4116
2  경남과학기술대학교  국공립   3771
3      경북대학교  국공립   4351
4      경상대학교  국공립   3967

In [380]:
college.shape    # 모양을 확인  196 X 3 Matrice

(196, 3)

In [381]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

- 스칼라인 정수가 먼저 브로드캐스팅이 되지만 
  - 문자열과 정수간의 덧셈이 발생하므로 예외(exception)가 발생한다.

In [383]:
try :
    college + 5          # 데이터프레임에 측정 정수를 더하면 예외가 발생된다.     
except Exception as e :  # 파이썬 문자열은 문자열간의 덧셈을 지원하지만 정수와의 덧셈은 불가함 
    print(e)

can only concatenate str (not "int") to str

- 평균등록금 컬럼만 정수이므로 단위를 맞추기 위해 1000을 곱함 
  - 이렇게 하면 새로운 Series가 발생된다.  
- 인덱스 검색에 평균등록금 컬럼 이름을 넣고 할당 연산자를 통해 갱신된 것을 할당하면 
  - 기존 데이터프레임 안의 평균등록금 컬럼의 데이터가 갱신이 된 것을 알 수가 있다.

In [385]:
college['평균등록금'] = college['평균등록금'] * 1000

In [386]:
college.head()

         학교명 설립구분       평균등록금
0    강릉원주대학교  국공립  4262000000
1      강원대학교  국공립  4116000000
2  경남과학기술대학교  국공립  3771000000
3      경북대학교  국공립  4351000000
4      경상대학교  국공립  3967000000

In [387]:
(college['평균등록금'] + college['평균등록금']).head()

0    8524000000
1    8232000000
2    7542000000
3    8702000000
4    7934000000
Name: 평균등록금, dtype: int64

- 연산자로 처리한 부분과 
  - 이 연산자에 해당하는 메소드를 실행한 결과를 확인하면 같은 결과가 나온다.

In [388]:
college['평균등록금'].add(college['평균등록금']).head()

0    8524000000
1    8232000000
2    7542000000
3    8702000000
4    7934000000
Name: 평균등록금, dtype: int64

- 어떻게 연산자와 이에 상응하는 메소드를 다 처리할 수 있는 지를 살펴봅시다.  
  - .add를 help 함수로 조회하면 
  - .add 메소드 내부에 여러 개의 매개변수가 있는 것을 알 수가 있다.

In [389]:
help(college['평균등록금'].add)

Help on method add in module pandas.core.ops:

add(other, level=None, fill_value=None, axis=0) method of pandas.core.series.Series instance
    Return Addition of series and other, element-wise (binary operator `add`).

    Equivalent to ``series + other``, but with support to substitute a fill_value for
    missing data in one of the inputs.

    Parameters
    ----------
    other : Series or scalar value
    fill_value : None or float value, default None (NaN)
        Fill existing missing (NaN) values, and any new element needed for
        successful Series alignment, with this value before computation.
        If data in both corresponding Series locations is missing
        the result will be missing.
    level : int or name
        Broadcast across a level, matching Index values on the
        passed MultiIndex level.

    Returns
    -------
    Series
        The result of the operation.

    See Also
    --------
    Series.radd

    Examples
    --------
    >>> a = pd.Series([1, 1, 1, np.nan], index=['a', 'b', 'c', 'd'])
    >>> a
    a    1.0
    b    1.0
    c    1.0
    d    NaN
    dtype: float64
    >>> b = pd.Series([1, np.nan, 1, np.nan], index=['a', 'b', 'd', 'e'])
    >>> b
    a    1.0
    b    NaN
    d    1.0
    e    NaN
    dtype: float64
    >>> a.add(b, fill_value=0)
    a    2.0
    b    1.0
    c    1.0
    d    1.0
    e    NaN
    dtype: float64

## 예제 3-3  특정 자료형을 가지고 열을 구분하기

#### 자료형 별로 데이터 검색 
- 데이터 프레임의 컬럼이 많을 경우 
  - 실제 계산을 하기 위해서는 계산에 필요한 컬럼을 별도로 구분하여 처리해야 한다.  
  - 이때 어떤 자료형으로 구성되어 있는 지를 메소드를 이용해서 구분하여 처리할 수가 있다.

In [391]:
college.dtypes

학교명      object
설립구분     object
평균등록금     int64
dtype: object

In [392]:
college.dtypes.value_counts()   # college.get_dtype_counts() -> college.dtypes.value_counts()

object    2
int64     1
dtype: int64

- 데이터 프레임 안의 특정 컬럼을 특정 datatype으로 읽어오는 방법이 있다.  
- 특정 data 자료형을 추출하기 위해 
  - select_dtypes 메소드의 include 매개변수에 데이터 자료형을 넣고 조회하면 
  - 새로운 데이터 프레임이 만들어 진다.

In [393]:
college.select_dtypes(include=['int64']).head()

        평균등록금
0  4262000000
1  4116000000
2  3771000000
3  4351000000
4  3967000000

- 전체 숫자 자료형으로 구성된 컬럼을 가져오려면 
  - number 문자열이나 
  - np.number를 매개변수에 넣고 조회하면 된다.

In [394]:
college.select_dtypes(include=['number']).head()

        평균등록금
0  4262000000
1  4116000000
2  3771000000
3  4351000000
4  3967000000

- 문자열로 구성된 컬럼도 object 문자열이나 np.object를 전달하면 
  - 컬럼을 전부 검색해 새로운 데에터 프레임을 만들게 된다.

In [396]:
college.select_dtypes(include=['object']).head()

         학교명 설립구분
0    강릉원주대학교  국공립
1      강원대학교  국공립
2  경남과학기술대학교  국공립
3      경북대학교  국공립
4      경상대학교  국공립

## 예제 3-4 시리즈 내의 자료값 확인하기

- Series안의 자료값이 공통으로 갖는 갯수에 대해 
  - .value_counts 메소드로 확인할 수가 있다. 
  - 빈도가 label로 변하고 그 빈도 수가 값으로 계산된 Series 객체를 결과값으로 반환한다.

In [398]:
college['평균등록금'].value_counts().head()

3424000000    2
7161000000    2
4521000000    1
6693000000    1
6779000000    1
Name: 평균등록금, dtype: int64

- Series의 값들에 대한 빈도를 %로 표시할 수 있는 normalize 매개변수도 지원한다.

In [399]:
college['평균등록금'].value_counts(normalize=True).head()

3424000000    0.010204
7161000000    0.010204
4521000000    0.005102
6693000000    0.005102
6779000000    0.005102
Name: 평균등록금, dtype: float64

In [401]:
college['설립구분'].value_counts().head()   # 한국에는 주로 사립대학이 많다.

사립     156
국공립     40
Name: 설립구분, dtype: int64

In [402]:
college['설립구분'].head()

0    국공립
1    국공립
2    국공립
3    국공립
4    국공립
Name: 설립구분, dtype: object

- 실제 들어있는 값들이 중복되어 있는 지 확인하기 위해 
  - .duplicated 메소드를 실행하면 논리식으로 평가된 결과를 제공한다.

In [404]:
college['설립구분'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: 설립구분, dtype: bool

- 유일한 값을 알고 싶을 경우 
  - .unique 메소드를 실행하면 numpy 배열 값으로 유일한 값을 반환한다.

In [406]:
college['설립구분'].unique()

array(['국공립', '사립'], dtype=object)

## 예제 3-5 내부 구성 값이 크기 비교

In [411]:
college['평균등록금'].nlargest(5)

173    9004000000
132    8824000000
128    8649000000
147    8526000000
146    8499000000
Name: 평균등록금, dtype: int64

In [412]:
college['평균등록금'].nsmallest(5)

61              0
157    1760000000
137    2000000000
20     2390000000
15     3024000000
Name: 평균등록금, dtype: int64

In [413]:
college.nlargest(5,'평균등록금')

           학교명 설립구분       평균등록금
173  한국산업기술대학교   사립  9004000000
132      연세대학교   사립  8824000000
128      신한대학교   사립  8649000000
147    이화여자대학교   사립  8526000000
146      을지대학교   사립  8499000000

In [414]:
college.nsmallest(5,'평균등록금')

          학교명 설립구분       평균등록금
61   광주가톨릭대학교   사립           0
157   중앙승가대학교   사립  1760000000
137   영산선학대학교   사립  2000000000
20    서울시립대학교  국공립  2390000000
15    부산교육대학교  국공립  3024000000

## 예제 3-6 시리즈만 가지는 메소드

In [213]:
op = pd.read_csv('../data/series_dataframe.csv')
op.head()

       Member      Series   DataFrame
0           T           T           T
1         abs         abs         abs
2         add         add         add
3  add_prefix  add_prefix  add_prefix
4  add_suffix  add_suffix  add_suffix

In [214]:
op_not = op.loc[(op['Series'] != op['DataFrame'])] 
op_not.head()

      Member    Series DataFrame
12  applymap       NaN  applymap
13    argmax    argmax       NaN
14    argmin    argmin       NaN
15   argsort   argsort       NaN
19  asobject  asobject       NaN

In [215]:
op_not.shape

(74, 3)

In [216]:
op_ser = op_not['Series'].dropna()
op_ser.head()

13      argmax
14      argmin
15     argsort
19    asobject
25    autocorr
Name: Series, dtype: object

In [217]:
op_ser_list = op_ser.tolist()
op_ser_list

['argmax',
 'argmin',
 'argsort',
 'asobject',
 'autocorr',
 'base',
 'between',
 'cat',
 'compress',
 'data',
 'dt',
 'dtype',
 'factorize',
 'flags',
 'from_array',
 'ftype',
 'hasnans',
 'imag',
 'is_monotonic',
 'is_monotonic_decreasing',
 'is_monotonic_increasing',
 'is_unique',
 'item',
 'items',
 'itemsize',
 'iteritems',
 'map',
 'name',
 'nbytes',
 'nonzero',
 'ptp',
 'put',
 'ravel',
 'real',
 'repeat',
 'reshape',
 'searchsorted',
 'str',
 'strides',
 'to_frame',
 'tolist',
 'unique',
 'valid',
 'value_counts',
 'view']

In [218]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.Series.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

argsort,  autocorr,  between,  items,  iteritems,
map,  ravel,  repeat,  searchsorted,  to_frame,
unique,  view,

## 예제 3-7 데이터프레임만 가지는 메소드

In [219]:
op_df = op_not['DataFrame'].dropna()

In [220]:
op_df_list = op_df.tolist()

In [221]:
count = 0
for i in op_ser_list :     
    try :
        
        if type(pd.DataFrame.__dict__[i])  ==  types.FunctionType :
            print(i, end=',  ')
            count += 1
            if count % 5 == 0 :
                print()
    except Exception as e :
        pass

items,  iteritems,

In [222]:
import seaborn as sns

In [223]:
iris = sns.load_dataset('iris')   # Seaborn Sample iris(붓꽃 데이터)
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [224]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

## 예제 3-8 인덱스 변경 및 대체

In [225]:
s = pd.Series([1,2,3,4])
s

0    1
1    2
2    3
3    4
dtype: int64

In [226]:
s_re = s.rename({0:'a',1:'b',2:'c',3:'d'})
s_re

a    1
b    2
c    3
d    4
dtype: int64

In [227]:
s_re.reindex(['a','b','c','e'])

a    1.0
b    2.0
c    3.0
e    NaN
dtype: float64

In [228]:
s_re.reindex(['a','b','c'])

a    1
b    2
c    3
dtype: int64

In [229]:
s_re.reindex(['c','b','a'])

c    3
b    2
a    1
dtype: int64

In [230]:
s_re     # 원형은 바뀌지 않았슴을 주의 !!!

a    1
b    2
c    3
d    4
dtype: int64

In [231]:
s1 = pd.Series([10,20,30], index=[0,1,2]) 
s1

0    10
1    20
2    30
dtype: int64

In [232]:
s1.index.dtype

dtype('int64')

In [233]:
s2 = pd.Series([1,2,3], index=list('012'))
s2

0    1
1    2
2    3
dtype: int64

In [234]:
s2.index.dtype

dtype('O')

In [235]:
s1 + s2

0   NaN
1   NaN
2   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [236]:
s2.index = [0,1,2]

In [237]:
s1 + s2

0    11
1    22
2    33
dtype: int64

In [238]:
s3 = pd.Series([11,12,13], index=list('012'))
s3

0    11
1    12
2    13
dtype: int64

In [239]:
s3 = s3.rename({'0':0, '1':1,'2':2})
s3

0    11
1    12
2    13
dtype: int64

In [240]:
s1 + s3

0    21
1    32
2    43
dtype: int64

In [241]:
s4 = pd.Series([11,12,13], index=list('012'))

In [242]:
s4.index.values

array(['0', '1', '2'], dtype=object)

In [243]:
s4.index = s4.index.values.astype('int64')

In [244]:
s1 + s4

0    21
1    32
2    43
dtype: int64

## 예제 3-9 특정 열에 대한 정보를 가져오기

In [245]:
flight_route_info = pd.read_csv('../data/flight_route_info.csv',encoding='cp949') 
flight_route_info.head()

,노선명,항공사,출발지,출발국,도착지,도착국,검수,2016.6,2018.5,상태,...,운송량_여름 총합,운송량_2016.9,운송량_2016.10,운송량_2016.11,운송량_2017.9,운송량_2017.10,운송량_2017.11,운송량_2016가을,운송량_2017가을,운송량_가을 총합
0,7J105,Tajik Air,DYU,TJK,IKA,IRI,O,O,O,완료,...,4258,842,985,596,746,597,448,2423,1791,4214
1,7J117,Tajik Air,DYU,TJK,DEL,IND,O,O,O,완료,...,3440,794,815,990,224,0,0,2599,224,2823
2,7J4801,Tajik Air,DYU,TJK,SVX,RUS,O,O,O,완료,...,3949,970,896,596,745,448,448,2462,1641,4103
3,7J4805,Tajik Air,DYU,TJK,SGC,RUS,O,O,O,완료,...,0,0,0,298,0,0,0,298,0,298
4,7J4849,Tajik Air,DYU,TJK,FRU,KGZ,O,O,O,완료,...,3604,767,788,596,298,0,0,2151,298,2449

In [246]:
flight_route_info.columns

Index(['노선명', '항공사', '출발지', '출발국', '도착지', '도착국', '검수', '2016.6', '2018.5',
       '상태', '비고', '운항 횟수', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_겨울 총합', '운항_2017.3', '운항_2017.4',
       '운항_2017.5', '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄',
       '운항_2018봄', '운항_봄 총합', '운항_2016.6', '운항_2016.7', '운항_2016.8',
       '운항_2017.6', '운항_2017.7', '운항_2017.8', '운항_2016여름', '운항_2017여름',
       '운항_여름 총합', '운항_2016.9', '운항_2016.10', '운항_2016.11', '운항_2017.9',
       '운항_2017.10', '운항_2017.11', '운항_2016가을', '운항_2017가을', '운항_가을 총합', '운송량',
       '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12', '운송량_2017.1',
       '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2', '운송량_2016겨울',
       '운송량_2017겨울', '운송량_겨울 총합', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_봄총합', '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6',
       '운송량_2017.7', '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_여름 총합',
       '운송량_2016.9', '운송량_2016.10', '운송량_2016.11', '운송량_2017.9', '운송량_2017.10',
       '운송량_2017.11', '운송량_2016가을', '운송량_2017가을', '운송량_가을 총합'],
      dtype='object')

In [247]:
flight_route_info.filter(like='2016.6').head()

  2016.6  운항_2016.6  운송량_2016.6
0      O          4         692
1      O          4         692
2      O          4         596
3      O          0           0
4      O          5         985

In [248]:
flight_regex = flight_route_info.filter(regex='\d')

In [249]:
flight_regex.columns

Index(['2016.6', '2018.5', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_2017.3', '운항_2017.4', '운항_2017.5',
       '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄', '운항_2018봄',
       '운항_2016.6', '운항_2016.7', '운항_2016.8', '운항_2017.6', '운항_2017.7',
       '운항_2017.8', '운항_2016여름', '운항_2017여름', '운항_2016.9', '운항_2016.10',
       '운항_2016.11', '운항_2017.9', '운항_2017.10', '운항_2017.11', '운항_2016가을',
       '운항_2017가을', '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12',
       '운송량_2017.1', '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2',
       '운송량_2016겨울', '운송량_2017겨울', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6', '운송량_2017.7',
       '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_2016.9', '운송량_2016.10',
       '운송량_2016.11', '운송량_2017.9', '운송량_2017.10', '운송량_2017.11', '운송량_2016가을',
       '운송량_2017가을'],
      dtype='object')

In [250]:
flight_route_info.filter(like='2018').head()

,2018.5,운항_2018,운항_2018.1,운항_2018.2,운항_2018.3,운항_2018.4,운항_2018.5,운항_2018봄,운송량_2018,운송량_2018.1,운송량_2018.2,운송량_2018.3,운송량_2018.4,운송량_2018.5,운송량_2018봄
0,O,22,4,5,5,5,3,13,3578,596,820,970,745,447,2162
1,O,23,5,4,4,6,4,14,4102,895,896,746,969,596,2311
2,O,16,4,2,4,4,2,10,2459,596,298,596,596,373,1565
3,O,9,1,2,2,3,1,6,1341,149,298,298,447,149,894
4,O,9,1,2,2,2,2,6,1416,149,298,373,298,298,969

## 예제 3-10 결측값을 처리하기

In [251]:
import numpy as np

In [252]:
s = pd.Series([0, 1, np.nan, 3])  
s

0    0.0
1    1.0
2    NaN
3    3.0
dtype: float64

In [253]:
s.fillna(method='ffill')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [254]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [255]:
s.fillna(method='bfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [256]:
s.fillna(method='backfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [257]:
flight_route_info.isnull().sum().head(13)

노선명          0
항공사          0
출발지          0
출발국          0
도착지          0
도착국          0
검수           0
2016.6       0
2018.5       0
상태           0
비고         412
운항 횟수        0
운항_2016      0
dtype: int64

In [258]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [259]:
flight_route_info.isnull().sum().sum()

412

In [260]:
flight_route_info['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.03.08. 하루 운항         2
2016.10 한 달 운항            2
Name: 비고, dtype: int64

In [261]:
flight_route_info['비고'].dtype

dtype('O')

In [262]:
flight_route_info.fillna(" ",axis=1, inplace=True)

In [263]:
flight_route_info.isnull().sum().sum()

0

In [264]:
flight_route_info['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2017.03.15. 하루 운항         2
2018.04.23. 이후 폐선         2
Name: 비고, dtype: int64

In [265]:
flight_route_info_2 = pd.read_csv('../data/flight_route_info.csv',encoding='cp949')

In [266]:
flight_route_info_2['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.03.08. 하루 운항         2
2016.10 한 달 운항            2
Name: 비고, dtype: int64

In [267]:
flight_route_info_3 = flight_route_info_2.select_dtypes(['object']).fillna('')

In [268]:
flight_route_info_3['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.03.08. 하루 운항         2
2016.10 한 달 운항            2
Name: 비고, dtype: int64

## 예제 3-11 결측값을 보간처리하기

In [269]:
import numpy as np

In [270]:
s = pd.Series([0, 1, np.nan, 3])

In [271]:
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [272]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')
airplane_info.head()

     기체번호       항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0  VP-BDK  Aeroflot  A320-214     0    20     0   120  140.0
1  VP-BWD  Aeroflot  A320-214     0    20     0   120  140.0
2  VP-BWE  Aeroflot  A320-214     0    20     0   120  140.0
3  VP-BWF  Aeroflot  A320-214     0    20     0   120  140.0
4  VP-BRZ  Aeroflot  A320-214     0    20     0   120  140.0

In [273]:
airplane_info.isnull().sum()

기체번호     0
항공사      0
기종       0
정원_F     0
정원_C     0
정원_W     0
정원_Y     0
총정원     71
dtype: int64

In [274]:
airplane_info[['기체번호','총정원']].tail()

        기체번호  총정원
2173  VP-BWW  NaN
2174  VP-BRM  NaN
2175  VP-BWZ  NaN
2176  VP-BWX  NaN
2177  VP-BRB  NaN

In [275]:
a = airplane_info['총정원'].interpolate()

In [276]:
a.isnull().sum()

0

In [277]:
a.tail()

2173    180.0
2174    180.0
2175    180.0
2176    180.0
2177    180.0
Name: 총정원, dtype: float64

## 예제 3-12 열 삭제

In [278]:
central_asia_flight_info = pd.read_csv('../data/central_asia_flight_info.csv',encoding='cp949')

In [279]:
central_asia_flight_info.head()

,노선명,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일,Unnamed: 11
0,7J105,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2016,6,5,NaN
1,7J105,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2016,6,12,NaN
2,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,6,19,NaN
3,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,6,26,NaN
4,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,7,3,NaN

In [280]:
central_asia_flight_info.count()

노선명            95015
출발 공항          95015
출발 국가          95015
도착 공항          95015
도착 국가          95015
기체번호           95015
기종             95015
정원(전체)         95015
년도             95015
월              95015
일              95015
Unnamed: 11        0
dtype: int64

In [281]:
central_asia_flight_info.isnull().sum()

노선명                0
출발 공항              0
출발 국가              0
도착 공항              0
도착 국가              0
기체번호               0
기종                 0
정원(전체)             0
년도                 0
월                  0
일                  0
Unnamed: 11    95015
dtype: int64

In [282]:
central = central_asia_flight_info.dropna(axis=1)

In [283]:
central.count()

노선명       95015
출발 공항     95015
출발 국가     95015
도착 공항     95015
도착 국가     95015
기체번호      95015
기종        95015
정원(전체)    95015
년도        95015
월         95015
일         95015
dtype: int64

In [284]:
central_drop = central_asia_flight_info.drop('Unnamed: 11', axis=1)

In [285]:
central_drop.count()

노선명       95015
출발 공항     95015
출발 국가     95015
도착 공항     95015
도착 국가     95015
기체번호      95015
기종        95015
정원(전체)    95015
년도        95015
월         95015
일         95015
dtype: int64

## 예제 3-13 행 삭제

In [286]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')

In [287]:
airplane_info.count()

기체번호    2178
항공사     2178
기종      2178
정원_F    2178
정원_C    2178
정원_W    2178
정원_Y    2178
총정원     2107
dtype: int64

In [288]:
import numpy as np

In [289]:
np.isnan(np.array([1,2,np.nan]))

array([False, False,  True])

In [290]:
airplane_info['총정원'].apply(np.isnan).tail()

2173    True
2174    True
2175    True
2176    True
2177    True
Name: 총정원, dtype: bool

In [291]:
airplane_info['총정원'].index

RangeIndex(start=0, stop=2178, step=1)

In [292]:
airplane_info['총정원'].index[[2107, 2108]]

Int64Index([2107, 2108], dtype='int64')

In [293]:
index_nan = airplane_info['총정원'].index[airplane_info['총정원'].apply(np.isnan)]

In [294]:
index_nan

Int64Index([2107, 2108, 2109, 2110, 2111, 2112, 2113, 2114, 2115, 2116, 2117,
            2118, 2119, 2120, 2121, 2122, 2123, 2124, 2125, 2126, 2127, 2128,
            2129, 2130, 2131, 2132, 2133, 2134, 2135, 2136, 2137, 2138, 2139,
            2140, 2141, 2142, 2143, 2144, 2145, 2146, 2147, 2148, 2149, 2150,
            2151, 2152, 2153, 2154, 2155, 2156, 2157, 2158, 2159, 2160, 2161,
            2162, 2163, 2164, 2165, 2166, 2167, 2168, 2169, 2170, 2171, 2172,
            2173, 2174, 2175, 2176, 2177],
           dtype='int64')

In [295]:
airplane_info_nan = airplane_info.drop(index=index_nan)

In [296]:
airplane_info_nan.shape

(2107, 8)

In [297]:
airplane_info_nan.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [298]:
airplane_info_dropna = airplane_info.dropna(axis=0)

In [299]:
airplane_info_dropna.shape

(2107, 8)

In [300]:
airplane_info_dropna.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [301]:
ai = airplane_info['총정원']

In [302]:
ai.isnull().sum()

71

In [303]:
ai_d = ai.dropna()

In [304]:
ai_d.isnull().sum()

0

## 예제 3-15 범주형 데이터 생성

In [305]:
s = pd.Series(["a","b","c","a"], dtype="category")
s

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

In [306]:
s.shape

(4,)

In [307]:
s.values.categories

Index(['a', 'b', 'c'], dtype='object')

In [308]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [309]:
s.dtype

CategoricalDtype(categories=['a', 'b', 'c'], ordered=False)

In [310]:
try : 
    s[2] = 'd'
except Exception as e :
    print(e)

Cannot setitem on a Categorical with a new category, set the categories first

In [311]:
s[2] = 'b'

In [312]:
try : 
    s[4] = 'c'
except Exception as e :
    print(e)

In [313]:
s.loc[4] ='c'

In [314]:
s

0    a
1    b
2    b
3    a
4    c
dtype: object

## 예제 3-16 범주형 데이터 클래스 이해하기

In [315]:
cat = pd.Categorical(['a','b','c'])

In [316]:
type(cat)

pandas.core.arrays.categorical.Categorical

In [317]:
c = set(dir(cat))

In [318]:
ss = set(dir(pd.Series))

In [319]:
c_d =  c - ss

In [320]:
count = 0 
for i in c_d :
    if not i.startswith("_") :
        count += 1
        print(i, end=", ")
        if count % 5 == 0 :
            print()

to_dense, add_categories, is_dtype_equal, remove_unused_categories, rename_categories,
reorder_categories, check_for_ordered, set_ordered, remove_categories, from_codes,
as_ordered, ordered, set_categories, take_nd, codes,
as_unordered, put, itemsize, categories,

In [321]:
cat.categories

Index(['a', 'b', 'c'], dtype='object')

In [322]:
cat.dtype

CategoricalDtype(categories=['a', 'b', 'c'], ordered=False)

In [323]:
s1 = pd.Series(["a","b","c","a"], dtype=cat.dtype)

In [324]:
s1

0    a
1    b
2    c
3    a
dtype: category
Categories (3, object): [a, b, c]

## 예제 3-17 데이터프레임에서 범주형 자료형 처리

In [325]:
import numpy as np

In [326]:
cat_1 = pd.Categorical(["a", "c", "c", np.nan], categories=["b", "a", "c"])

In [327]:
cat_1.dtype

CategoricalDtype(categories=['b', 'a', 'c'], ordered=False)

In [328]:
df = pd.DataFrame({"cat":cat_1, "s":["a", "c", "c", np.nan]})

In [329]:
df

   cat    s
0    a    a
1    c    c
2    c    c
3  NaN  NaN

In [330]:
df.select_dtypes(exclude=['object'])

   cat
0    a
1    c
2    c
3  NaN

In [331]:
df['cat'][3] = 'b'
df

  cat    s
0   a    a
1   c    c
2   c    c
3   b  NaN

In [332]:
df.loc[4,:] = ['a','a']

In [333]:
df

  cat    s
0   a    a
1   c    c
2   c    c
3   b  NaN
4   a    a

## 예제 3-18 파일을 읽어서 범주형 자료형으로 변경처리

In [334]:
airplane = pd.read_csv('../data/airplane_info.csv',encoding='cp949') 
airplane.head()

     기체번호       항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원
0  VP-BDK  Aeroflot  A320-214     0    20     0   120  140.0
1  VP-BWD  Aeroflot  A320-214     0    20     0   120  140.0
2  VP-BWE  Aeroflot  A320-214     0    20     0   120  140.0
3  VP-BWF  Aeroflot  A320-214     0    20     0   120  140.0
4  VP-BRZ  Aeroflot  A320-214     0    20     0   120  140.0

In [335]:
airplane['항공사'].dtype

dtype('O')

In [336]:
air_cat = pd.Categorical(airplane['항공사'])

In [337]:
air_cat.categories

Index(['AZAL Azerbaijan Airlines', 'Aeroflot', 'Air Arabia', 'Air Astana',
       'Air Baltic', 'Air China', 'Air Kyrgyzstan', 'Air Manas',
       'Airzena Georgian Airways', 'Asiana Airlines', 'AtlasGlobal',
       'Avia Traffic Company', 'Belavia', 'China Southern Airlines',
       'Ellinair', 'Etihad Airways', 'Finnair', 'Globus Airlines',
       'Hainan Airlines', 'Iran Aseman Airlines', 'KLM Royal Dutch Airlines',
       'Kam Air', 'Korean Air', 'LOT - Polish Airlines', 'Lufthansa',
       'MIAT - Monglian Airlines', 'Mahan Air', 'NordStar', 'Pegas Fly',
       'Pegasus Airlines', 'Pobeda', 'Red Wings', 'Rusline', 'S7 Airlines',
       'SCAT', 'Somon Air', 'Sunday Airlines', 'Tajik Air', 'Turkish Airlines',
       'Turkmenistan Airlines', 'Ukraine International Airlines',
       'Ural Airlines', 'Urumqi Air', 'Utair', 'Uzbekistan Airways',
       'VIM Airlines', 'Wizz Air', 'Yakutia Airlines', 'Yamal Airlines',
       'flydubai'],
      dtype='object')

In [338]:
air_cat

[Aeroflot, Aeroflot, Aeroflot, Aeroflot, Aeroflot, ..., Red Wings, Red Wings, Red Wings, Red Wings, Red Wings]
Length: 2178
Categories (50, object): [AZAL Azerbaijan Airlines, Aeroflot, Air Arabia, Air Astana, ..., Wizz Air, Yakutia Airlines, Yamal Airlines, flydubai]

In [339]:
air_cat.shape

(2178,)

In [340]:
airplane['항공사'].dtype

dtype('O')

In [341]:
airplane['항공사'] = airplane['항공사'].astype(air_cat)

In [342]:
airplane['항공사'].dtype

CategoricalDtype(categories=['AZAL Azerbaijan Airlines', 'Aeroflot', 'Air Arabia',
                  'Air Astana', 'Air Baltic', 'Air China', 'Air Kyrgyzstan',
                  'Air Manas', 'Airzena Georgian Airways', 'Asiana Airlines',
                  'AtlasGlobal', 'Avia Traffic Company', 'Belavia',
                  'China Southern Airlines', 'Ellinair', 'Etihad Airways',
                  'Finnair', 'Globus Airlines', 'Hainan Airlines',
                  'Iran Aseman Airlines', 'KLM Royal Dutch Airlines',
                  'Kam Air', 'Korean Air', 'LOT - Polish Airlines',
                  'Lufthansa', 'MIAT - Monglian Airlines', 'Mahan Air',
                  'NordStar', 'Pegas Fly', 'Pegasus Airlines', 'Pobeda',
                  'Red Wings', 'Rusline', 'S7 Airlines', 'SCAT', 'Somon Air',
                  'Sunday Airlines', 'Tajik Air', 'Turkish Airlines',
                  'Turkmenistan Airlines', 'Ukraine International Airlines',
                  'Ural Airlines', 'Urumqi Air', 'Utair', 'Uzbekistan Airways',
                  'VIM Airlines', 'Wizz Air', 'Yakutia Airlines',
                  'Yamal Airlines', 'flydubai'],
                 ordered=False)

In [343]:
try :
    airplane['항공사'][0] = "Asia Airline"
except Exception as e :
    print(e)

Cannot setitem on a Categorical with a new category, set the categories first

In [344]:
airplane.isnull().sum()

기체번호     0
항공사      0
기종       0
정원_F     0
정원_C     0
정원_W     0
정원_Y     0
총정원     71
dtype: int64

In [345]:
airplane.columns

Index(['기체번호', '항공사', '기종', '정원_F', '정원_C', '정원_W', '정원_Y', '총정원'], dtype='object')

In [346]:
airplane['총정원'].isnull().sum()

71

In [347]:
airplane.loc[airplane['총정원'].isnull(), '총정원']  =   \
     airplane.loc[airplane['총정원'].isnull(), '정원_Y']

In [348]:
airplane.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [349]:
airplane['총정원'].between(1,120).sum()

235

In [350]:
mask = airplane['총정원'].between(1,120)

In [351]:
import numpy as np

In [352]:
airplane['category_R'] = ""

In [353]:
airplane['category_R']  = pd.Categorical(np.where(mask, '소형', '중형'))

In [354]:
airplane.head()

     기체번호       항공사        기종  정원_F  정원_C  정원_W  정원_Y    총정원 category_R
0  VP-BDK  Aeroflot  A320-214     0    20     0   120  140.0         중형
1  VP-BWD  Aeroflot  A320-214     0    20     0   120  140.0         중형
2  VP-BWE  Aeroflot  A320-214     0    20     0   120  140.0         중형
3  VP-BWF  Aeroflot  A320-214     0    20     0   120  140.0         중형
4  VP-BRZ  Aeroflot  A320-214     0    20     0   120  140.0         중형

In [355]:
airplane['category_R'].value_counts()

중형    1943
소형     235
Name: category_R, dtype: int64

In [356]:
airplane['category_R'].dtype

CategoricalDtype(categories=['소형', '중형'], ordered=False)

In [357]:
np.zeros(10000*10000)

array([0., 0., 0., ..., 0., 0., 0.])